{
  "安抚型": [
    "焦虑如水波荡漾，但水终归平静。深呼吸三次，让内心的代码重新编译，Bug总会被修复的。",
    "压力山大时，记住你是那个能解决复杂算法的人。今日宜静心整理需求文档，让混乱变得有序。",
    "心如止水不是目标，而是过程。就像重构代码一样，一行行梳理，焦虑自然消散。",
    "水性至柔却能穿石，你的坚持比你想象的更有力量。今日适合小步快跑，不要给自己太大压力。",
    "焦虑是内心的异常捕获，试着写个心情日志，把烦恼序列化输出，然后重启你的状态。"
  ],
  "疏导型": [
    "怒火如代码编译错误，越急越乱。停下来，走两步，就像重启IDE一样，给情绪一个clean build的机会。",
    "火能毁灭也能创造，愤怒是你内心的能量在溢出。今日宜运动发泄，或者写段暴力美学的代码。",
    "程序员的愤怒通常源于逻辑的不合理，先修复内心的bug，再去解决外界的问题。",
    "怒气冲冲时，想象自己是个exception handler，优雅地处理这个情绪异常，然后continue执行。",
    "火性急躁但燃烧后必有灰烬沉淀。今日宜暂时离开屏幕，让大脑的热度降下来。"
  ],
  "鼓励型": [
    "土厚德载物，你承受的每一次挫折都在为下一次突破积蓄能量。今日宜回顾已完成的项目，重燃自信。",
    "沮丧是git里的uncommitted changes，不代表你的进步消失了。今日适合小目标达成，重新找回节奏。",
    "每个优秀的程序员都经历过深度debug的黑暗时刻，但最终都会看到那一行修复世界的代码。",
    "土性沉稳，虽然现在低落，但正如算法的时间复杂度，持续优化终会获得最优解。",
    "失落时记住：你写的每一行代码都在改变世界，即使是最小的功能也有人在使用并受益。"
  ],
  "理性型": [
    "兴奋如木之生发，但需要合理架构才能长成参天大树。今日宜制定详细计划，让激情有序释放。",
    "激动的时候最容易产生技术债务，保持冷静，让兴奋的能量投入到可持续的发展中。",
    "木性向上但需要根基，将你的热情转化为具体的代码实现，避免空中楼阁。",
    "兴奋是最好的编程状态，但记住要写注释，Future You会感谢Present You的理性。",
    "高涨的情绪如同高并发，需要合理的线程管理。今日适合专注一个重点任务，避免多线程混乱。"
  ],
  "维持型": [
    "金性收敛，内心平静是程序员的最佳状态。今日宜深度思考，进行技术总结或学习新知识。",
    "平静如代码运行在最优状态，无需急于改变。今日适合重构历史代码，让优雅成为日常。",
    "心如止水时是架构设计的最佳时机，趁着思路清晰，画出那张系统蓝图吧。",
    "金性珍贵，这份平静值得珍惜。今日宜进行深度阅读，让知识在安静中沉淀。",
    "平静是最高级的生产力状态，就像编写elegant code一样，简洁而有力。"
  ],
  "引导型": [
    "困惑如迷雾，但每个问题都有解决方案。今日宜分解复杂问题，化大为小，逐一攻破。",
    "迷茫时不如回到基础，就像遇到bug时从最简单的输入开始测试。基础扎实，方向自明。",
    "水性变化，困惑是思维在寻找新的流向。今日适合寻求导师或同事的建议，集体智慧胜过独自摸索。",
    "编程路上的困惑如同算法复杂度分析，看起来复杂，但拆解后总有最优解。",
    "困惑是大脑在升级，就像系统更新时的短暂卡顿。给自己一些时间，clarity自然会来。"
  ],
  "恢复型": [
    "累了就休息，就像CPU需要降频一样，给大脑一些喘息的空间。劳逸结合才是最佳性能。",
    "疲惫是身体的Warning信号，不要忽略。今日宜关机休息，明日满血复活。",
    "土性厚重，疲惫时正是积蓄能量的时候。睡个好觉，让内存清空，状态重置。",
    "过度消耗如同内存泄漏，及时休息是最好的垃圾回收。今日适合放下代码，拥抱枕头。",
    "疲惫如系统负载过高，暂停非必要进程，专注核心功能：好好休息。"
  ],
  "接纳型": [
    "有些bug就是feature，有些现实就是设定。接受它，然后寻找workaround。",
    "金性内敛，无奈时正是韬光养晦的好时机。今日适合蓄力，静待时机。",
    "无奈如同遇到deprecated的API，抱怨无用，不如学习新的替代方案。",
    "现实的限制如同编程的约束，在约束中创造，在限制中突破。",
    "接受是智慧的开始，就像接受技术债务，然后制定重构计划。"
  ],
  "激励型": [
    "期待是最好的动力源，就像优秀的算法一样高效且持续。将你的期待转化为具体的action plan。",
    "火性向上的你充满能量，这种期待值得被实现。制定清晰的roadmap，一步步接近目标。",
    "期待如同编程中的future promise，需要耐心等待resolve。保持激情，但也要做好异常处理。",
    "满怀期待的状态是创造力的巅峰，利用这种能量去学习新技术、挑战新项目、突破新高度。",
    "期待让生活充满可能性，就像开源社区一样，每个contribution都可能带来意想不到的收获。"
  ],
  "观察型": [
    "客观记录如同写技术文档，平实而有价值。有时候冷静观察比激烈反应更有智慧。",
    "金性收敛的特质让你具备优秀的分析能力，这种状态适合进行系统性思考和技术总结。",
    "没有强烈情绪也是一种状态，如同系统运行在stable模式。利用这种平稳进行深度学习。",
    "客观理性是程序员的核心素质，保持这种状态，专注于技术本身的逻辑和美感。",
    "观察者的视角往往能发现别人忽略的细节，这种冷静客观正是架构师所需的品质。"
  ],
  "通用型": [
    "每一种情绪都是内心的API调用，理解它，处理它，然后继续你的人生代码。",
    "情绪如同程序的状态，可以被观察、分析和优化。今日的你已经比昨日更强。",
    "五行流转，情绪更替，这是生命的自然规律。保持觉察，保持成长。",
    "程序员的内心也需要版本管理，记录成长，拥抱变化，持续迭代。"
  ]
}